mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G0xx_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.6" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32G0xx_DFP</name>
  <description>STMicroelectronics STM32G0 Series Device Support</description>
  <url>https://www.keil.com/pack/</url>

  <releases>
    <release version="1.2.0" date="2019-07-19">
      Updated STM32Cube Firmware G0 library to version V1.3.0.
      Added CubeMX support.
      Added device support for:
      - STM32G030, STM32G031, STM32G041 devices.
      - Updated device documentation.
      - Updated SVD files for each STM32G0xx subfamily.
    </release>
    <release version="1.1.0" date="2019-04-01">
      Updated documentation
      Updated CubeMX FW pack to STM32Cube_FW_G0_V1.1.0
    </release>
    <release version="1.0.0" date="2018-12-04">
      Initial version of STM32G0 Device Family Pack for use with:
      - STM32CubeMX 5.0
      - STM32Cube G0 Firmware Package V1.0.0
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32G0</keyword>
    <keyword>STM32G0xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32G0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dclock="64000000" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian"/>
      <book name="Documentation/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <description>
      The STM32G0 mainstream microcontrollers are based on high-performance Arm Cortex-M0+ 32-bit RISC core operating at up to 64 MHz frequency.
      Offering a high level of integration, they are suitable for a wide range of applications in consumer, industrial and appliance domains and ready for the Internet of Things (IoT) solutions.
       - Up to 128 Kbytes of Flash memory
       – 36 Kbytes of SRAM (32 Kbytes with HW parity check)
       - CRC calculation unit
       - Up to 60 fast I/Os
       - 7-channel DMA controller with flexible mapping
       - 14 timers (two 112 MHz capable): 16-bit for advanced motor control, one 32-bit and five 16-bit general-purpose, two basic 16-bit, two lowpower 16-bit, two watchdogs, SysTick timer
       - Calendar RTC with alarm and periodic wakeup from Stop/Standby
       - 96-bit unique ID
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            Sequence("CheckID");
          </block>
        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x4002103C, Read32(0x4002103C) | 0x08000000);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Freeze Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Freeze Behavior
          </block>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>

      </sequences>

      <!-- ************************  Subfamily 'STM32G030'  **************************** -->
      <subFamily DsubFamily="STM32G030">
        <debug svd="CMSIS/SVD/STM32G030.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G030xx"/>
        <book name="Documentation/DM00463896.pdf" title="STM32G0x0 Reference Manual"/>
<!--    <book name="Documentation/xx.pdf" title="STM32G030x6/x8 Data Sheet"/> -->

        <debugvars configfile="CMSIS/Debug/STM32G0x0.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x0_OPT.FLM"    start="0x1FFF7800" size="0x0000000C" default="0"/>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32G030C6Tx'  ***************************** -->
        <device Dname="STM32G030C6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G030F6Px'  ***************************** -->
        <device Dname="STM32G030F6Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G030J6Mx'  ***************************** -->
        <device Dname="STM32G030J6Mx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="8" name="SO8N"/>
        </device>

        <!-- *************************  Device 'STM32G030K6Tx'  ***************************** -->
        <device Dname="STM32G030K6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32G030C8Tx'  ***************************** -->
        <device Dname="STM32G030C8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G030K8Tx'  ***************************** -->
        <device Dname="STM32G030K8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32G031'  **************************** -->
      <subFamily DsubFamily="STM32G031">
        <debug svd="CMSIS/SVD/STM32G031.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G031xx"/>
        <book name="Documentation/DM00371828.pdf" title="STM32G0x1 Reference Manual"/>
<!--    <book name="Documentation/DS12992.pdf"    title="STM32G031x4/x6/x8 Data Sheet"/> -->

        <debugvars configfile="CMSIS/Debug/STM32G0x1.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x1_OPT.FLM"    start="0x1FFF7800" size="0x00000020" default="0"/>

        <!-- ################################### 16 KB ################################## -->
        <!-- *************************  Device 'STM32G031C4Tx'  ***************************** -->
        <device Dname="STM32G031C4Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

