mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G0xx_DFP.1.2.0.pdsc
          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031C4Ux'  ***************************** -->
        <device Dname="STM32G031C4Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031F4Px'  ***************************** -->
        <device Dname="STM32G031F4Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G031G4Ux'  ***************************** -->
        <device Dname="STM32G031G4Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G031J4Mx'  ***************************** -->
        <device Dname="STM32G031J4Mx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="SOP" n="8" name="SO8N"/>
        </device>

        <!-- *************************  Device 'STM32G031K4Tx'  ***************************** -->
        <device Dname="STM32G031K4Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G031K4Ux'  ***************************** -->
        <device Dname="STM32G031K4Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_16.FLM"    start="0x08000000" size="0x00004000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32G031C6Tx'  ***************************** -->
        <device Dname="STM32G031C6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031C6Ux'  ***************************** -->
        <device Dname="STM32G031C6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031F6Px'  ***************************** -->
        <device Dname="STM32G031F6Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G031G6Ux'  ***************************** -->
        <device Dname="STM32G031G6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G031J6Mx'  ***************************** -->
        <device Dname="STM32G031J6Mx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="8" name="SO8N"/>
        </device>

