mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G0xx_DFP.1.2.0.pdsc
        <!-- *************************  Device 'STM32G031K6Tx'  ***************************** -->
        <device Dname="STM32G031K6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G031K6Ux'  ***************************** -->
        <device Dname="STM32G031K6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32G031C8Tx'  ***************************** -->
        <device Dname="STM32G031C8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031C8Ux'  ***************************** -->
        <device Dname="STM32G031C8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G031F8Px'  ***************************** -->
        <device Dname="STM32G031F8Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G031G8Ux'  ***************************** -->
        <device Dname="STM32G031G8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G031K8Tx'  ***************************** -->
        <device Dname="STM32G031K8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G031K8Ux'  ***************************** -->
        <device Dname="STM32G031K8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G031Y8Yx'  ***************************** -->
        <device Dname="STM32G031Y8Yx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="CSP" n="18"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32G041'  **************************** -->
      <subFamily DsubFamily="STM32G041">
        <debug svd="CMSIS/SVD/STM32G041.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G041xx"/>
        <book name="Documentation/DM00371828.pdf" title="STM32G0x1 Reference Manual"/>
<!--    <book name="Documentation/DS12993.pdf"    title="STM32G041x6/x8 Data Sheet"/> -->

        <debugvars configfile="CMSIS/Debug/STM32G0x1.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x1_OPT.FLM"    start="0x1FFF7800" size="0x00000020" default="0"/>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32G041C6Tx'  ***************************** -->
        <device Dname="STM32G041C6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G041C6Ux'  ***************************** -->
        <device Dname="STM32G041C6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

