mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G0xx_DFP.1.2.0.pdsc
        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32G071CBTx'  ***************************** -->
        <device Dname="STM32G071CBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071CBUx'  ***************************** -->
        <device Dname="STM32G071CBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071EBYx'  ***************************** -->
        <device Dname="STM32G071EBYx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="CSP" n="25"/>
        </device>

        <!-- *************************  Device 'STM32G071GBUx'  ***************************** -->
        <device Dname="STM32G071GBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G071GBUxN'  **************************** -->
        <device Dname="STM32G071GBUxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G071KBTx'  ***************************** -->
        <device Dname="STM32G071KBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071KBTxN'  **************************** -->
        <device Dname="STM32G071KBTxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071KBUx'  ***************************** -->
        <device Dname="STM32G071KBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071KBUxN'  **************************** -->
        <device Dname="STM32G071KBUxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071RBIx'  ***************************** -->
        <device Dname="STM32G071RBIx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32G071RBTx'  ***************************** -->
        <device Dname="STM32G071RBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="64"/>
        </device>

      </subFamily>

