mdhardenburgh/Blinky/Packages/.cache/Keil.STM32G0xx_DFP.1.2.0.pdsc
    <!-- START: STMicroelectronics STM32CubeG0 HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.3.0" condition="STM32G0 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32G0xx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32G0xx_HAL_Driver/Inc/Legacy/"/>
        <file category="header"  name="Drivers/STM32G0xx_HAL_Driver/Inc/stm32g0xx_hal.h"/>
        <file category="source"  name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"       Cversion="1.3.0" condition="STM32G0 HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_adc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CEC"       Cversion="1.3.0" condition="STM32G0 HAL">
      <description>Consumer Electronics Control (CEC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CEC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_cec.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMP"      Cversion="1.3.0" condition="STM32G0 HAL">
      <description>Comparator (COMP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.3.0" condition="STM32G0 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.3.0" condition="STM32G0 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_crc.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_crc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP"      Cversion="1.3.0" condition="STM32G0 HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_cryp.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_cryp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC"       Cversion="1.3.0" condition="STM32G0 HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_dac_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.3.0" condition="STM32G0 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_dma_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI"      Cversion="1.3.0" condition="STM32G0 HAL">
      <description>External Interrupt HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.3.0" condition="STM32G0 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_flash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.3.0" condition="STM32G0 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.3.0" condition="STM32G0 HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32G0xx_HAL_Driver/Src/stm32g0xx_hal_i2c_ex.c"/>
      </files>
    </component>
